Revit 2026 API

# View3DShowGridsOnLevel Method

---

This method displays the grid lines in this 3DView on the given Level.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void ShowGridsOnLevel(
	ElementId levelId
)
```
```vb
Public Sub ShowGridsOnLevel (
	levelId As ElementId
)
```
```cpp
public:
void ShowGridsOnLevel(
	ElementId^ levelId
)
```
```fsharp
member ShowGridsOnLevel :
        levelId : ElementId -> unit
```

#### Parameters

levelId ElementId
     The id of the Level where grids should be displayed.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

Grids will be displayed only if they intersects Level's plane.

#### Reference

View3D Class

Autodesk.Revit.DB Namespace